sdaiRenameModel(Sdai_instS*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte*)
\details
Renames the model.
\param model     [in] A model to be renamed.
\param modelName [in] A string that contains the new model name.